	[
	{
	"File_name": "Fortiva-01-Abbasi-2018-In-home-Robots-Improve-social-skills-in-children-with-autism.pdf", 
	"Paper_title": "Biotech Innovations", 
	"Reference": "Abbasi, J. (2018). Biotech Innovations. JAMA, 320(4), 329-330.", 
	"Citation": "(Abbasi, 2018)", 
	"A1": "Yes, the study aimed at developing or evaluating Social Communication skills. The paper mentions that children with autism showed improvements in social skills, including making more eye contact, initiating social interactions more frequently, and responding appropriately to social requests.", 
	"A2": "N/A. The study does not explicitly mention developing or evaluating Emotional Intelligence skills.", 
	"A3": "N/A. The study does not explicitly mention developing or evaluating Language and Speech skills.", 
	"A4": "N/A. The study does not explicitly mention developing or evaluating Cognitive Skills.", 
	"A5": "Yes, the study aimed at developing or evaluating Social Cognition skills. The paper mentions that children showed significant improvements in joint attention ability, which is a critical social skill often deficient in autism.", 
	"A6": "N/A. The study does not explicitly mention developing or evaluating Physical and Motor Development skills.", 
	"A7": "N/A. The study does not explicitly mention developing or evaluating Self-Management and Adaptive Skills.", 
	"A8": "Yes, the study aimed at studying children with autism spectrum disorder (ASD). The paper states that the study involved 12 children with autism spectrum disorder between 6 and 12 years old.", 
	"A9": "N/A. The study focused on children aged 6-12 and did not include adolescents with ASD.", 
	"A10": "N/A. The study focused on children aged 6-12 and did not include adults with ASD.", 
	"A11": "N/A. The study specifically focused on children with autism spectrum disorder and did not include children with other neurodevelopmental disabilities.", 
	"A12": "N/A. The study did not include adolescents with other neurodevelopmental disabilities.", 
	"A13": "N/A. The study did not include adults with other neurodevelopmental disabilities.", 
	"A14": "Yes, the study carried out Social Interaction Activities with robots. The paper mentions that children played social skills games with their caregiver and a robot that speaks and exhibits expressive behaviors.", 
	"A15": "N/A. The study does not explicitly mention carrying out Storytelling and Play-based Activities with robots.", 
	"A16": "N/A. The study does not explicitly mention carrying out Imitation and Movement Activities with robots.", 
	"A17": "N/A. The study does not explicitly mention carrying out Emotion and Expression Recognition Activities with robots.", 
	"A18": "N/A. The study does not explicitly mention carrying out Music and Rhythm Activities with robots.", 
	"A19": "N/A. The study does not explicitly mention carrying out Executive Function and Cognitive Activities with robots.", 
	"A20": "N/A. The study does not explicitly mention carrying out Communication and Language Activities with robots." 
	}, 
	{
	"File_name": "Fortiva-02-Abdelmohsen-y-Arafa-2021-Training-Social-Skills-of-Children-with-ASD-Throug.pdf", 
	"Paper_title": "Training Social Skills of Children with ASD Through Social Virtual Robot", 
	"Reference": "Abdelmohsen, M., & Arafa, Y. (2021). Training Social Skills of Children with ASD Through Social Virtual Robot. [No publication information available]", 
	"Citation": "(Abdelmohsen & Arafa, 2021)", 
	"A1": "Yes, the authors aimed at developing and evaluating social communication skills, specifically mentioning social skills training for children with ASD.", 
	"A2": "Yes, the authors aimed at developing and evaluating emotional intelligence skills, particularly emotion recognition and expression.", 
	"A3": "N/A. The study does not explicitly mention developing or evaluating language and speech skills.", 
	"A4": "N/A. The study does not explicitly mention developing or evaluating cognitive skills.", 
	"A5": "Yes, the authors aimed at developing and evaluating social cognition skills, specifically imitation and gesture recognition.", 
	"A6": "N/A. The study does not explicitly mention developing or evaluating physical and motor development skills.", 
	"A7": "N/A. The study does not explicitly mention developing or evaluating self-management and adaptive skills.", 
	"A8": "Yes, the study aimed at studying children with autism spectrum disorder (ASD), specifically mentioning children aged 4 to 12 years.", 
	"A9": "N/A. The study does not explicitly mention studying adolescents with ASD.", 
	"A10": "N/A. The study does not mention studying adults with ASD.", 
	"A11": "N/A. The study does not mention studying children with other neurodevelopmental disabilities.", 
	"A12": "N/A. The study does not mention studying adolescents with other neurodevelopmental disabilities.", 
	"A13": "N/A. The study does not mention studying adults with other neurodevelopmental disabilities.", 
	"A14": "Yes, the study carried out social interaction activities with a virtual robot, including interactive scenarios for social skills training.", 
	"A15": "Yes, the study included storytelling activities with the virtual robot, particularly in the emotion recognition training phase.", 
	"A16": "Yes, the study included imitation activities with the virtual robot, specifically for training imitation skills and gesture production.", 
	"A17": "Yes, the study included emotion and expression recognition activities with the virtual robot, focusing on recognizing and expressing the six basic emotions.", 
	"A18": "N/A. The study does not mention using music and rhythm activities with robots.", 
	"A19": "N/A. The study does not mention using executive function and cognitive activities with robots.", 
	"A20": "N/A. While the study involves communication, it does not specifically mention the listed communication and language activities with robots."
	}
	] 